// @(h)CtlRenderBox.cs ver 0.00 ( '24.06.30 Nov-Lab ) 作成開始
// @(h)CtlRenderBox.cs ver 0.51 ( '24.06.30 Nov-Lab ) ベータ版完成
// @(h)CtlRenderBox.cs ver 0.51a( '24.07.03 Nov-Lab ) その他  ：コメント整理

// @(s)
// 　【描画ボックスコントロール】OnRender メソッドをオーバーライドしてカスタムの描画を行うことができるコントロールです。

using System;
using System.Collections.Generic;
using System.Text;
using System.Windows;
using System.Windows.Controls;
using System.Windows.Data;
using System.Windows.Documents;
using System.Windows.Input;
using System.Windows.Media;
using System.Windows.Media.Imaging;
using System.Windows.Navigation;
using System.Windows.Shapes;


namespace Exam_WPF
{
    //====================================================================================================
    /// <summary>
    /// 【描画ボックスコントロール】
    /// <see cref="UIElement.OnRender"/> メソッドをオーバーライドしてカスタムの描画を行うことができるコントロールです。
    /// </summary>
    //====================================================================================================
    public partial class CtlRenderBox : UserControl
    {
        //====================================================================================================
        // デリゲート定義
        //====================================================================================================

        //--------------------------------------------------------------------------------
        /// <summary>
        /// 【描画実行コールバックデリゲート】カスタムの描画を行うメソッドのデリゲートです。
        /// </summary>
        /// <param name="dc">        [in ]：DrawingContext</param>
        /// <param name="renderSize">[in ]：描画サイズ</param>
        //--------------------------------------------------------------------------------
        public delegate void DoRenderCallback(DrawingContext dc, Size renderSize);


        //====================================================================================================
        // 公開プロパティー
        //====================================================================================================

        /// <summary>
        /// 【描画実行コールバック】<see cref="UIElement.OnRender"/> が呼び出されたときにカスタムの描画を行うメソッドです。
        /// </summary>
        public DoRenderCallback DoRender { get; set; }


        //====================================================================================================
        // static 内部プロパティー
        //====================================================================================================

        /// <summary>
        /// 【枠線描画用ペン】デザイン時や、描画実行コールバック未設定時に、コントロールの枠線を描画するためのペンです。
        /// </summary>
        protected readonly static Pen m_borderPen = new Pen(Brushes.Red, 2.0f);


        //====================================================================================================
        // コンストラクターと公開メソッド
        //====================================================================================================

        //--------------------------------------------------------------------------------
        /// <summary>
        /// 【コンストラクター】描画ボックスコントロールの新しいインスタンスを生成します。
        /// (自動生成された内容のままです。)
        /// </summary>
        //--------------------------------------------------------------------------------
        public CtlRenderBox()
        {
            InitializeComponent();
        }


        //--------------------------------------------------------------------------------
        /// <summary>
        /// 【OnRender】コントロールを描画します。
        /// </summary>
        /// <param name="dc">[in ]：DrawingContext</param>
        //--------------------------------------------------------------------------------
        protected override void OnRender(DrawingContext dc)
        {
            //------------------------------------------------------------
            /// 基本クラスの処理を行う
            //------------------------------------------------------------
            base.OnRender(dc);


            //------------------------------------------------------------
            /// コントロールを描画する
            //------------------------------------------------------------
            if (DoRender == null)
            {                                                           //// 描画実行コールバックが未設定の場合(デザイン時を含む)
                dc.DrawRectangle(null, m_borderPen,                     /////  枠線を描画する
                    new Rect(0, 0, RenderSize.Width, RenderSize.Height));
            }
            else
            {                                                           //// 描画実行コールバックが設定されている場合
                DoRender(dc, RenderSize);                               /////  コールバック処理を行う
            }
        }

    } // class

} // namespace
